{"id":4985,"date":"2024-12-31T05:51:00","date_gmt":"2024-12-31T05:51:00","guid":{"rendered":"https:\/\/imbutofoundation.org\/?p=4985"},"modified":"2025-02-14T05:52:36","modified_gmt":"2025-02-14T05:52:36","slug":"oeuvrons-a-batir-des-familles-rwandaises-heureuses-et-soudees","status":"publish","type":"post","link":"https:\/\/imbutofoundation.org\/oeuvrons-a-batir-des-familles-rwandaises-heureuses-et-soudees\/","title":{"rendered":"Oeuvrons à bâtir des familles rwandaises heureuses et soudées"},"content":{"rendered":"\n<p>Ce n’est pas un secret : chaque mois de décembre, Kigali semble véritablement se transformer en capitale des mariages, ajoutant aux fêtes de fin d’année des traditions romantiques dignes des contes de fées. Quelle merveilleuse raison de célébrer, que le romantisme!<\/p>\n\n\n\n<p>J’admets avoir une vision plutôt traditionaliste des âmes passionnées. Mais j’ai aussi la ferme conviction que nos cœurs sont faits pour être comblés et c’est dans cet esprit que je souhaite à chacun d’entre vous la plénitude d’aimer et d’être aimés en retour. Une question s’impose néanmoins: comment faire pour y parvenir ? Car après tout, on ne peut récolter que ce que l’on a semé…<\/p>\n\n\n\n<p><strong>Oui, nous aspirons tous à être aimés.<\/strong><\/p>\n\n\n\n<p>Nous voulons croire qu’il existe une personne qui saura lire en nous, nous accepter pour ce que nous sommes, nous faire une place dans leur vie et croire en nous. Une personne qui saura se porter à notre défense et nous porter vers le haut. Une personne qui saura apprécier nos efforts et notre présence dans leur vie.<\/p>\n\n\n\n<p>Cependant, paralysés par la crainte d’une trop grande vulnérabilité ou de cet acte de foi que le mariage représente, certains ressentent une peur d’aimer ou d’aimer à nouveau pleinement et de s’engager avec un partenaire pour la vie.<\/p>\n\n\n\n<p>Mais dans ce cas, on s’expose alors à des commentaires qui ne relèvent pas de notre vécu, où les récits liés à des déceptions peuvent résonner bien plus fort que ceux qui ont trait aux unions réussies. Car certaines des perspectives contemporaines sur le mariage peuvent en effet s’avérer déroutantes, voire décourageantes.<\/p>\n\n\n\n<p>Ainsi, une bonne partie de la jeunesse d’aujourd’hui se dit désillusionnée par l’institution du mariage comme si l’échec ou le regret en étaient la norme. Pourtant, aucun dividende ne peut être récolté sur un investissement qui n’a pas été réalisé de façon réfléchie, même s’il existe toujours des risques inhérents. Une maison qui n’a pas été construite solidement brique par brique ne peut pas offrir un abri sûr. Un foyer qui n’a pas été construit avec amour ne peut rayonner d’un amour sincère.<\/p>\n\n\n\n<p>Rejeter l’idée du mariage, en refuser même la possibilité, c’est condamner notre vision de celui-ci à l’échec. Et ce, sans pour autant en avoir fait l’expérience, qu’il s’agisse par ailleurs d’un mariage entre personnes qui se ressemblent ou…s’opposent!<\/p>\n\n\n\n<p><strong>Et si le mariage était un dessein divin, voire un mystère, au-delà des différences ?<\/strong><\/p>\n\n\n\n<p>En effet, tout comme le “yin&#8221; s’équilibre parfaitement avec le “yang&#8221;, le jour s’alterne parfaitement avec la nuit. Et si ‘les contraires s’attiraient” comme le dit un dicton populaire? Si des couples différents mais complémentaires, étaient destinés à se rencontrer, à s’aimer malgré leurs imperfections et à s’améliorer mutuellement ?<\/p>\n\n\n\n<p>Bien sûr, l’amour de soi reste primordial, mais à quoi ressemblerait le monde si nous ne nous mariions qu’à ceux qui nous ressemblent, renforçant ainsi uniquement nos similitudes? Autrement dit, en évitant ces différences qui nous permettraient pourtant de combler des lacunes dans notre perception des choses et de la société humaine? Nous courrions alors le risque de nous retrouver dans un monde bien narcissique !<\/p>\n\n\n\n<p><strong><br>Et si un mariage sain valait toujours son pesant d’or?<br><\/strong><br>Les valeurs que l’humanité a adoptées à travers des milliers d’années de civilisation – comme l’institution du mariage – ne peuvent être ramenées à un mauvais choix collectif, mais sont plutôt l’héritage de siècles d’apprentissages, d’études et de tentatives visant à améliorer l’expérience humaine.<\/p>\n\n\n\n<p>La rencontre de l’homme et de la femme est à la source même de la vie. Mais lorsque nous n’arrivons pas à reconnaître la beauté divine d’une union dévouée, le mariage devient alors une croix épineuse et lourde à porter.<\/p>\n\n\n\n<p>Oui, le mariage implique des sacrifices. Le fait de se donner à l’autre à l’autel sacré est le symbole même de la disparition de son ancien soi, pour renaître dans un corps en partage entre deux personnes unies par la force de l’amour, et dignes d’un si beau cadeau. Ce sacrifice mutuel est réalisé dans l’intention de les épanouir tous les deux.<\/p>\n\n\n\n<p>Non, le mariage n’est pas l’acte final d’une relation d’amour. Faire partie intégrante d’un couple exige une transformation évolutive. Ce type d’union ne peut rester solide qu’à travers une volonté mutuelle de grandir, une communication transparente, de la compréhension et de la compassion. Un mariage s’épanouit dans la reconnaissance, l’acceptation et le respect des différences. Mais aussi dans la valorisation des complémentarités, le renouvellement et l’adaptation continus de chacun.<br><strong><br>Et si nous concilions les valeurs traditionnelles avec la modernité ?<br><\/strong><br>Des valeurs familiales compromises me semblent être à la fois le symptôme et l’effet d’un déclin sociétal.<\/p>\n\n\n\n<p>Qui a terni l’image du mariage? La famille n’est pourtant pas un piège, mais bien au contraire une bénédiction.<\/p>\n\n\n\n<p>Quand de l’amour entre deux conjoints naît la tendresse avec laquelle un enfant s’accroche à votre doigt; quand de l’amour d’un conjoint naît la volonté de toujours faire mieux professionnellement; quand suite à des voeux d’engagement pour la vie, des familles et des communautés sont solidement accompagnées lorsqu’elles traversent de dures épreuves…Quand on met ces réalités en évidence, je me demande si choisir un partenaire de vie et rester fidèle à son foyer, signifie que l’on risque de perdre quelque chose d’important ou plutôt de remporter un précieux trésor ?<\/p>\n\n\n\n<p>Mais peut-être que mon époque était plus simple.<\/p>\n\n\n\n<p>Aujourd’hui, nombreux sont ceux qui restent rivés sur des écrans qui les submergent d’images, exposant des scènes de vies toujours plus attirantes en apparence. Des photos ajustées et retouchées, des modes de vie glamour d’une perfection douteuse, des romances surjouées et idéalisées qui sont offertes à une jeunesse pleine de rêves, créant l’illusion de choix infinis ailleurs.<\/p>\n\n\n\n<p>En réalité, personne ne possède la solution miracle de la perfection et sûrement pas le mystérieux séducteur qui se met soigneusement en scène sur ces écrans pour convaincre un public sur internet ou à la télévision du charme de son apparence ou de son caractère. Aucun ménage vivant dans le monde réel et non pas virtuel, ne traverse une vie de couple sans affronter des moments exigeant patience et maturité.<\/p>\n\n\n\n<p>Qu’il s’agisse d’études, de carrière, d’amitié, de la transformation d’un pays ou de la fondation d’une famille, rien d’important ne s’obtient sans surmonter de défis et sans faire le choix parfois difficile de poursuivre quoiqu’il en coûte un plan soigneusement élaboré.<\/p>\n\n\n\n<p><strong>Et si aimer son conjoint revenait à intégrer pleinement le concept de responsabilité personnelle?<br><\/strong><br>La politique et même la spiritualité ne peuvent que partiellement contribuer à installer le bonheur dans nos foyers. En tant qu’individus autonomes, ce sont nos choix et nos actions qui témoignent de notre volonté à créer des familles saines et aimantes pour nous, et surtout pour nos enfants.<\/p>\n\n\n\n<p>Même dans les foyers les plus aimants, la raison doit prédominer sur la passion et la réflexion doit toujours primer sur le besoin de gratification immédiate. Au final, quel sens y a-t-il à compromettre le bien-être familial pour le seul besoin d’éprouver un sentiment d’indépendance juvénile &#8211; voire puérile &#8211; ou de dominer son partenaire ? Une dynamique familiale toxique peut éroder les liens les plus précieux et détruire la santé mentale et physique de tous les membres qui y sont exposés.<\/p>\n\n\n\n<p><strong><br>Peut-on réellement parler d’un vainqueur dans un conflit qui brise un foyer ?<\/strong><\/p>\n\n\n\n<p>Lorsqu’elles sont accompagnées adéquatement, les familles peuvent accomplir des miracles, surmonter les défis des premières années d’adaptation au sein d’un mariage et constituer un exemple pour les générations à venir.<\/p>\n\n\n\n<p>En fin de compte, honorer la bénédiction que sont nos familles exige richesse intérieure et discernement : pour s’épanouir, les enfants ont essentiellement besoin de temps de qualité, de soins, d’attention et d’échanges sains avec les deux parents. D’ailleurs, le nombre d’adultes issus de foyers modestes mais aimants et qui conservent en eux de merveilleux souvenirs d’enfance, en est une preuve indéniable.<\/p>\n\n\n\n<p>Les parents resteront toujours des parents et continueront à prodiguer leurs conseils<\/p>\n\n\n\n<p>En cette saison des fêtes, soyons aussi responsables et intentionnels dans nos célébrations qu’en amour !<\/p>\n\n\n\n<p>Je partage ici les leçons que le temps m’a apprises, en espérant qu’elles permettront aux enfants de ce pays &#8211; que j’aimerai toujours profondément – de faire leur chemin de vie, munis des outils et des connaissances qui contribueront à leur réussite.<\/p>\n\n\n\n<p>Rappelez-vous qu’une famille surmonte les hauts et les bas ensemble.<\/p>\n\n\n\n<p>Rappelez-vous qu’il appartient à chacun de faire de son mariage quelque chose de sacré ou un parfait simulacre. Il n’y a pas de juste milieu.<\/p>\n\n\n\n<p>Rappelez-vous que lorsque vous choisissez le futur parent de votre enfant, vous devriez vous tourner vers la personne qui incarne les valeurs que vous souhaitez inculquer à votre enfant, tout en ayant conscience bien sûr que tout comme vous, personne n’est parfait.<\/p>\n\n\n\n<p>Tout ceci demande des efforts, mais il s’agit d’un véritable travail d’amour qui s’inscrit dans la durée.<\/p>\n\n\n\n<p>Traitez votre partenaire avec la même douceur et la même patience que celles que vous espérez voir accordées un jour à votre enfant<\/p>\n\n\n\n<p>Au fil des années, votre couple grandira ensemble et rencontrera des défis imprévus qui mettront à rude épreuve votre foi en l’un et en l’autre. Ne craignez pas cependant, de commencer cette aventure et de la vivre pleinement même si elle devait prendre fin : cultivez des valeurs d’amitié, une véritable complicité, et préservez toujours la dignité de l’autre.&nbsp;<strong>Aimez comme vous souhaiteriez être aimé(e)!<\/strong><\/p>\n\n\n\n<p>Nourrissez un optimisme éclairé plutôt qu’un cynisme du romantisme.<\/p>\n\n\n\n<p>Le Rwanda auquel nous aspirons tous commence par la cellule familiale et là, c’est bien vous qui détenez les clés et avez le pouvoir d’agir.<\/p>\n\n\n\n<p>Enfin, je voudrais insister sur ces quelques outils de réussite élaborés à travers une approche intergénérationnelle, que sont le dialogue au sein des couples et le dialogue au sein des familles à toutes les étapes de la vie. Tous parents que nous sommes, sachez que nous souhaitons entendre la voix des jeunes, non seulement pour mieux nous informer mais également pour mieux nous en inspirer.<\/p>\n\n\n\n<p>Pour ce qui est des unions saines et de l’épanouissement des familles rwandaises, nos portes seront toujours ouvertes à vos idées, vos questions, vos observations et votre sagesse.<\/p>\n\n\n\n<p>Merci d’avoir pris le temps de lire ces mots et merci d’aimer avec un grand A !<\/p>\n\n\n\n<p>Joyeuses fêtes, et que les foyers de nos couples nouvellement formés en cette saison festive, soient des havres de paix et d’amour !<\/p>\n\n\n\n<p><strong>S.E. Madame Jeannette Kagame<br>Première Dame de la République du Rwanda<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ce n’est pas un secret : chaque mois de décembre, Kigali semble véritablement se transformer en capitale des mariages, ajoutant aux fêtes de fin d’année des traditions romantiques dignes des (…)<\/p>\n","protected":false},"author":1,"featured_media":4178,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[52],"tags":[],"class_list":["post-4985","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-our-story"],"acf":[],"_links":{"self":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts\/4985","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/comments?post=4985"}],"version-history":[{"count":1,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts\/4985\/revisions"}],"predecessor-version":[{"id":4986,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts\/4985\/revisions\/4986"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/media\/4178"}],"wp:attachment":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/media?parent=4985"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/categories?post=4985"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/tags?post=4985"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}