{"id":4988,"date":"2024-12-27T05:52:00","date_gmt":"2024-12-27T05:52:00","guid":{"rendered":"https:\/\/imbutofoundation.org\/?p=4988"},"modified":"2025-02-14T05:54:43","modified_gmt":"2025-02-14T05:54:43","slug":"umuryango-utekanye-isooko-yubwumvikane-mu-bashakanye","status":"publish","type":"post","link":"https:\/\/imbutofoundation.org\/umuryango-utekanye-isooko-yubwumvikane-mu-bashakanye\/","title":{"rendered":"Umuryango Utekanye: Isôoko y’Ubwumvikane mu Bashakanye"},"content":{"rendered":"\n<p>Nta byiza nko gusoza no gutangirana umwaka umugisha w’urukundo.<\/p>\n\n\n\n<p>Ntibikiri ibanga ko i Kigali, Ukuboza ari ukwezi kwera ibirori by’ubukwe byiyongera ku byishimo bisanzwe byo gusoza umwaka. Ni umwanya mwiza rero wo kwishimana n’umuryango.<\/p>\n\n\n\n<p>Muri izi mpera z’umwaka nifuje ko twaganira ku gihango cyo kwitanaho no koroherana kw’abashakanye, bakiyemeza gushinga urugo, ruvukamo kandi rukarera umuntu utekanye.<\/p>\n\n\n\n<p>Mu buzima bw’umuntu muri rusange, ntawe utanyurwa n’umunezero w’urukundo, ngo akunde kandi nawe akundwe.<\/p>\n\n\n\n<p>Mu gushinga urugo, buri wese aba yifuza ko uwo bashakanye amuha umwanya umukwiye mu buzima bwe, mu mibanire yabo ya buri munsi akamutega amatwi, akamwubaha, akamwubahisha mu bandi, akamurwanira ishyaka ndetse agashyigikira ibitekerezo bye.<\/p>\n\n\n\n<p>Kubera ibivugwa ku kubaka urugo, ndetse n’abahitamo kugaragaza ibibi gusa, hari abumva ko nta munezero uba mu rugo. Ibi ntibyagakwiye kuba akarande, kuko hari ingero nyinshi z’abarushinze rugakomera, bakaba babayeho mu munezero.<\/p>\n\n\n\n<p>Iyo uganira na benshi mu bagize urubyiruko bakubwira ko bumva batagishishikajwe no kubaka urugo. Ibi babihuza n’uko hari ingo nyinshi zitameze neza!<br>Ntabwo ari cyo gipimo cyatwereka umubano mwiza w’abashakanye, usibye ko nanone nta wakwirengagiza amakuru menshi avugwa ku ngo akenshi ashobora gutera ubwoba no guca intege abatarashinga urugo.<\/p>\n\n\n\n<p>Nk’uko tubizi rero, ntawe usarura icyo atabibye! Urugo rudafite umusingi ukomeye, rutubakiye ku rukundo no mu bworoherane ntabwo rwakubera “Ijuru rito” nk’uko bikunze kuvugwa.<\/p>\n\n\n\n<p><strong>Kubaka urugo ni umuhamagaro!<\/strong><\/p>\n\n\n\n<p>Amanywa n’ijoro ntibisa nyamara biruzuzanya kandi mu mwihariko wa buri kimwe. Umubano no guhuza kw’abashakanye ntibisaba ko bose baba ari intungane cyangwa bahuje imyumvire n’imyitwarire.<\/p>\n\n\n\n<p>Mu Kinyarwanda tuvuga ko “<strong>Nta mwiza wabuze inenge<\/strong>”. Buri wese mu bubaka urugo ashobora kugira inenge. Ni byiza rero ko mugenzi we arebana umutima ukunda n’ubworoherane ibyiza asanganywe, kugira ngo amufashe kuba umuntu mwiza kurushaho.<\/p>\n\n\n\n<p>Kwikunda ni byiza kandi bigomba kubaho. Ntawabasha gukunda mugenzi we byuzuye we atabanje kwikunda kuko umuntu atanga icyo afite.<br>Kubera ko ntawakwikunda wenyine ngo bimunyure ku buryo atakenera undi wamwunganira aho adashoboye, niho ibanga ryo gushaka rihera, rikuganisha kubaka urugo, nkuko abakubanjirije babikoze, bigahererekanwa no mu bazadukomokaho ibihe byose.<\/p>\n\n\n\n<p><strong>Imbuto ubibye niyo usarura.<\/strong><\/p>\n\n\n\n<p>Kubaka urugo cyangwa gushyingiranwa hagati y’abashakanye, ni umurage tugenda duhererekanya uko ibihe bisimburana. Uko ibihe bihinduka, imibereho igahinduka, tukagira iterambere mu nzego zitandukanye, uwo murage dukomeza kuwukomeraho.<\/p>\n\n\n\n<p>Kubaka k’umugore n’umugabo ni isôoko y’umunezero usaba kwigomwa no kwirenga kugira ngo urugo rutabera abantu “ikigeragezo”.<\/p>\n\n\n\n<p>Kuba isezerano ryo gushyingirwa ritangirwa kuri alitari cyangwa n’ahandi abantu basengera, bishushanya kwigomwa, bisaba umuntu kwirenga, kugira ngo we n’uwo bagiye gushyingiranwa, babe umwe, batangirane urugendo rushya rw’urugo, nk’uko babyiyemeje.<\/p>\n\n\n\n<p>Uku kwirenga ni yo mpano ikomeye abashyingiranywe bashobora guhana -Ni igihango gikomeye.<\/p>\n\n\n\n<p>N’ubwo ari igihango, gushyingiranwa ubwabyo ntabwo bihagije. Kwiyemeza kuba umwe bisaba no kwiyemeza guhinduka. Kugira ngo uwo mubano uzashoboke kandi ube uw’iteka ryose, buri wese mu bashyingiranywe asabwa kwemera gukura, kuba umunyakuri, kugira umutima w’impuhwe kandi wumva.<\/p>\n\n\n\n<p>Umubano w’abashakanye ukomezwa no kuba buri wese yumva ahawe agaciro, hari umwumva, kandi n’ibyo batumvikanyeho ntibibe impamvu yo gushyamirana, ahubwo bagashakira igisubizo hamwe mu bwumvikane n’amahoro.<\/p>\n\n\n\n<p>Ni koko, kubona ingo zidakomeye ni ikimenyetso cy’uko umuryango mugari utameze neza muri rusange.<\/p>\n\n\n\n<p>Ese ni nde wasize icyasha uyu muhamagaro mwiza? Kubaka urugo ukagira umuryango, si umutego nk’uko bivugwa, ahubwo ni umugisha.<\/p>\n\n\n\n<p>Birashoboka ko mu gihe cyo ha mbere byari byoroshye kurushaho.<\/p>\n\n\n\n<p>Muri iyi minsi abantu bahugiye muri byinshi, bahoza amaso ku mashusho atunganyijwe mu buhanga bwinshi, ngo agaragaze ubuzima bwiza bw’urukundo rutagira inenge.<\/p>\n\n\n\n<p><strong>Nyamara ni amashusho nyine.<\/strong><\/p>\n\n\n\n<p>Ibi byahura n’inzozi urubyiruko rwa none rufite, hakaba abibwira ko hakiri igihe cyo guhitamo ibyiza bindi biruse ibyo babona uyu munsi.<\/p>\n\n\n\n<p><strong>Nta muryango utagira Mukuru!<\/strong><\/p>\n\n\n\n<p>N’ubwo nta gitabo cy’amabwiriza y’uko umuntu yabaho ubuzima buzira inenge n’imwe, nta muryango utagira mukuru. Kumva inama z’inyangamugayo no guhuza iterambere n’indangagaciro z’umuryango ni ngombwa kugira ngo umuntu abashe kurema urugo ruhire.<\/p>\n\n\n\n<p>Umuntu ni umuntu utangaje! Agira ubushishozi bwinshi mu guhitamo ibihe byiza by’ubuzima, ngo yerekane ko ari umuntu mwiza, ubayeho neza ndetse ko n’abandi bakwiye kugenza nkawe.<\/p>\n\n\n\n<p>Nta rugo na rumwe rwabaho rudahuye n’ibigerageza urukundo rwabo. Ari ukwiga amashuri menshi, akazi, inshuti, iterambere rindi mu nzego zitandukanye z’igihugu, cyangwa kubaka umuryango, nta na kimwe muri ibi cyangwa n’ibindi bijyanye n’iterambere ry’umuntu byizana mu buryo bworoshye. Byose biraharanirwa.<\/p>\n\n\n\n<p><strong>Byaba bimaze iki guhora mu mpaka n’uwo mwashakanye kandi ukanezezwa n’uko wamutsinze niba ari ibibasenyera?<\/strong><\/p>\n\n\n\n<p>Nibyo koko, Abayobozi b’igihugu, ab’amadini hari byinshi bakora ngo bagerageza gufasha abantu kugira ingo nziza zirangwa n’umunezero. Ariko kuko buri muntu afite ubushobozi bwo kwihitiramo ibimubereye, ni ngombwa ko nawe ahitamo kandi agaharanira kubaka urugo rwiza, rwuje urukundo. Ibi bireba kandi abakuru n’abato bose hamwe.<\/p>\n\n\n\n<p>No mu ngo nziza z’abakundana, ni ngombwa kugira ubushishozi<br>kugirango amarangamutima adasumba ibindi byose.<\/p>\n\n\n\n<p>Twibaze tuti, byaba bimaze iki kubaho ubuzima bwo kwigenga muri byose, cyangwa gushaka guhora wemeza uwo mwashakanye, niba bihungabanya ituze n’amahoro by’umuryango wawe?<\/p>\n\n\n\n<p>N’aho abashakanye baba bakundana byuzuye, bafite urugo rwiza, gushyamirana n’imyitwarire mibi bya hato na hato bishobora kugira ingaruka zikomeye haba ku buzima bw’abashakanye n’ubuzima rusange bw’umuryango.<\/p>\n\n\n\n<p><strong>Nta mwana ukura imbere y’umubyeyi &#8211; Umubyeyi ahorana igishyika cy’abana be!<\/strong><\/p>\n\n\n\n<p>Iyo imiryango iherekejwe neza nk’uko bikwiriye ishobora kugera kuri byinshi bitangaje, urugo rukiri ruto rukabasha kurenga imyaka ya mbere igora benshi, rukazakura, rukaba intangarugero.<\/p>\n\n\n\n<p>Umuryango ni umugisha ukomeye. Umunezero w’umuryango ntabwo ushingira ku butunzi bw’ibifatika. Kugira ngo umuryango ubeho neza unezerewe, ukeneye umwanya wacu, kuganira no gusabana bihoraho hagati y’abana n’ababyeyi bombi.<\/p>\n\n\n\n<p>Nifuje kubasangiza bimwe mu byo nigiye mu buzima bwanjye byafasha umuntu kubaho ubuzima bwiza. Nifuje kandi kongera kwibutsa abato bacu ko mbakunda kandi mbifuriza ibyiza. Nizeye ko ubu butumwa buzabafasha.<\/p>\n\n\n\n<p>Umuryango ushyize hamwe nta cyawuhungabanya.<\/p>\n\n\n\n<p>Umuntu ni we wenyine ushobora guhitamo ko urugo rwe ruba “<strong>Ijuru rito ku isi<\/strong>”.<\/p>\n\n\n\n<p>Ku bifuza kubaka urugo, mu gihe uhitamo uwo muzubakana, shishoza uhitemo umuntu ufite indangagaciro wifuza kuzabona mu rubyaro rwawe, ariko unazirikana ko nta muntu utunganye, nawe ubwawe udatunganye.<\/p>\n\n\n\n<p>Ibi bisaba kwirenga, ariko ni ngombwa kuko ni ko kubaka urukundo rwuzuye, ari ryo pfundo ry’urugo rwiza.<\/p>\n\n\n\n<p><strong>Ineza no kwihanganirwa wifuriza umwana wawe abe ari byo ugirira uwo mwashyingiranywe.<\/strong><\/p>\n\n\n\n<p>Muri buri rugo, abashakanye uko bagenda bamarana igihe bahura n’ibibazo bishobora rimwe na rimwe kubahindura bikabatera no gushidikanya, ariko ntawe bikwiye gutera ubwoba ngo yibuze uwo<br>mugisha.<\/p>\n\n\n\n<p>Ubuzima umuntu yifuza bugereranywa n’undi mushinga wose, igishoro n’umwanya bihawe ugena uko uwo mushinga uzagenda.<\/p>\n\n\n\n<p>Umushinga w’urugo nawo ni uko, usaba kubaka ubucuti, kubahana no kurinda icyubahiro cya mugenzi wawe.<\/p>\n\n\n\n<p>Ukunde nk’uko nawe wifuza gukundwa. Wange ibitekerezo n’inama mbi, kandi ugire kwizera.<br>U Rwanda twifuza ruhera ku rugo rwiza n’umuryango utekanye! Kubigeraho bisaba uruhare rwa buri wese.<br>Duhugurane. Twongere duhe agaciro ibiganiro hagati y’abagize umuryango, ibiganiro bihoraho bifasha abashakanye. N’ubwo turi bakuru, nk’ababyeyi banyu ntabwo twifuza guhora ari twe tubaganiriza gusa, twifuza kumva namwe inama zanyu kuko kwiga ari uguhozaho kandi namwe hari byinshi twabigiraho.<br>Twiteguye kubatega amatwi no kubafasha gusobanukirwa ibyo mudasobanukiwe byabafasha kubaka ingo nziza.<\/p>\n\n\n\n<p>Mbashimiye umwanya wanyu. Mukomeze mwubakire ku rukundo nyakuri.<\/p>\n\n\n\n<p>Twifurije abashyingirwa ubu n’ingo zimaze igihe gito zubatswe, kuba igicumbi cy’ibyishimo n’abagabuzi b’amahoro.<\/p>\n\n\n\n<p>Mukomeze ipfundo ry’urukundo rukomeza urugo ruhire rwuje ubudaheranwa. Mubyare kandi murerere u Rwanda abato barukomeza.<\/p>\n\n\n\n<p>Mugire ibihe byiza bisoza umwaka.<\/p>\n\n\n\n<p><strong>Nyakubahwa Madamu Jeannette Kagame<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Nta byiza nko gusoza no gutangirana umwaka umugisha w’urukundo. Ntibikiri ibanga ko i Kigali, Ukuboza ari ukwezi kwera ibirori by’ubukwe byiyongera ku byishimo bisanzwe byo gusoza umwaka. Ni (…)<\/p>\n","protected":false},"author":1,"featured_media":4989,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[52],"tags":[],"class_list":["post-4988","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-our-story"],"acf":[],"_links":{"self":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts\/4988","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/comments?post=4988"}],"version-history":[{"count":1,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts\/4988\/revisions"}],"predecessor-version":[{"id":4990,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts\/4988\/revisions\/4990"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/media\/4989"}],"wp:attachment":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/media?parent=4988"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/categories?post=4988"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/tags?post=4988"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}