{"id":4994,"date":"2024-09-27T05:56:00","date_gmt":"2024-09-27T05:56:00","guid":{"rendered":"https:\/\/imbutofoundation.org\/?p=4994"},"modified":"2025-02-14T05:57:44","modified_gmt":"2025-02-14T05:57:44","slug":"clean-body-clean-mind-clean-soul-a-30-year-old-case-for-physical-intellectual-and-spiritual-hygiene-2","status":"publish","type":"post","link":"https:\/\/imbutofoundation.org\/clean-body-clean-mind-clean-soul-a-30-year-old-case-for-physical-intellectual-and-spiritual-hygiene-2\/","title":{"rendered":"Clean Body, Clean Mind, Clean Soul: A 30-year old case for physical, intellectual and spiritual hygiene"},"content":{"rendered":"\n<p>The past few months have been a whirlwind of celebrations, with Rwandans from every corner of the country rejoicing over new milestones, new aspirations, and a renewed opportunity to bring our “big dreams” to life.<\/p>\n\n\n\n<p>I can still hear the chants from seas of colourfully-clad citizens, beaming under a fierce mid-year sun, undeterred by its intensity.<\/p>\n\n\n\n<p>I can still feel the energy of an entire nation singing as one.<\/p>\n\n\n\n<p>“Umuturage ku isonga.”<\/p>\n\n\n\n<p>Indeed: we are owed every last effort from those upon which has been bestowed the honour to serve.<\/p>\n\n\n\n<p>But this effort cannot be solely demanded from those in service.<\/p>\n\n\n\n<p>Today I write, because I believe that the cleaner the canvas, the clearer emerges a collective masterpiece. A mosaic of our unique experiences and ambitions; a tapestry of our national ideals.<\/p>\n\n\n\n<p>We Dare Strive for Better Yet<\/p>\n\n\n\n<p>The “Rwandan miracle”, as some have coined it, attributes our environmental and ideological cleanse to divine providence. But consistently sweeping your streets of dust, being accountable to your community, banking on unity, or empowering your youth (among other efforts), all require something much more intentional than good fortune. These choices require purpose. The vision that nourishes it, and the willpower to materialise it.<\/p>\n\n\n\n<p>The Vision Starts With The Form<\/p>\n\n\n\n<p>A clean Rwanda aspires to house Rwandans clean in presentation, clean in habits, clean in practices, and clean in ideals. Our populations will always deserve better than to embody the stereotypes that have been regrettably forced upon us. Indeed, our streets, public offices, places of business and homes should be clean, because what other dignified choice is there truly?<\/p>\n\n\n\n<p>The cleanup of the landscape of a once failed state was absolutely worth its arduous course. Going back to the disorder unjustly deemed characteristic of our continent would be inconceivable…Particularly to the youth that, fortunately, did not experience Rwanda at its worst.<\/p>\n\n\n\n<p>Cleanliness is a universal value; it is not a notion exclusive to a privileged few. No one should concede that uncleanliness would define their experience of life.<\/p>\n\n\n\n<p>Throughout history, health crises resulting from poor sanitary practices have ravaged entire continents, sweeping hundreds of millions in their destructive spree.<\/p>\n\n\n\n<p>In every possible aspect, disregard for the physical form hinders good health, and even the most resilient health systems can only help so far, if the personal responsibility to treat our bodies with care is not espoused.<\/p>\n\n\n\n<p>These systems have taught us that how we tend to the surfaces of our bodies is as important as what we allow these bodies to absorb or ingest.<\/p>\n\n\n\n<p>One would not water a plant with poisoned water, for that would be dooming it to rapid withering…But how different is it to willingly ingest substantial amounts of unhealthy food or drink? What crimes have our bodies committed, to warrant such consistent punishment?<\/p>\n\n\n\n<p>It is time for a cleanse…in every sense of the term.<\/p>\n\n\n\n<p>No More Brain Pollution<\/p>\n\n\n\n<p>While appearances are important, our bodies are merely a vessel; an outer layer of our existence on earth.<\/p>\n\n\n\n<p>Inner cleanliness is, at the very least, as vital as outer cleanliness, for a cluttered interior undermines even the most pristine exterior.<\/p>\n\n\n\n<p>And yet, the cleanup within is even harder still.<\/p>\n\n\n\n<p>Flooded with so much information and worldly influences, it is difficult to distinguish between novel trends and dangerous practices, instinct and conditioning, entertainment and distraction, education and manipulation, self-expression and ego-centrism, freedom and depravity.<\/p>\n\n\n\n<p>Constant exposure to lifestyles deemed most desirable &#8211; yet deceptively presented &#8211; has warped our sense of priority; making battles for status, popularity, affluence or exposure at the expense of culture and self-education, advocacy for worthy causes, and commitment to societal progress.<\/p>\n\n\n\n<p>Though the trees rightfully rejoiced as screens replaced the printed page, were adequate measures taken to guarantee that this transition would genuinely enhance our collective well-being?<br>Are we reading enough? Are we listening as attentively? Are we rewarding empathy as much as we do dominance and influence?<br>Sometimes, I catch myself in need of a mind cleanse; a moment of respite from the influx of mediatic noise, to reflect, to analyse, to wonder. To re-think and declutter.<\/p>\n\n\n\n<p>I believe this ought to be as customary, and as personal a responsibility as the morning’s wash. To sit together and exchange, to actively empathise with those around us, to share wisdoms both old and new, to care enough to advise but avoid the entitlement to judge, to gather around great art…This message is a case for the rituals that keep us clean within &#8211; rituals that seem worryingly less common as time advances.<\/p>\n\n\n\n<p>The Spiritual Dilemma<\/p>\n\n\n\n<p>One cannot attempt to discuss the concepts of cleanliness or purity without addressing religion and spirituality.<br>Whatever your beliefs, you have likely been exposed to organised religion’s encouragement of cleanliness in the values we embody, and the divine purpose we serve.<\/p>\n\n\n\n<p>● To tell the truth,<br>● To be honest and dignified,<br>● To cling fiercely to our humility and serve accordingly &#8211; for the whole is greater than the sum of its parts,<br>● To be kind to one another,<br>● To love one another (John 13”34-35: A new command I give you: Love one another)<\/p>\n\n\n\n<p>These are all religious teachings that, beyond their purity, are vital to our common welfare.<\/p>\n\n\n\n<p>What we need to be aware of, however, are preachers of purity that employ impure tactics, to get their “holy” message across.<\/p>\n\n\n\n<p>Mine is a merciful God of Love, compassion, reconciliation, and protection. Not a God of terror, judgement and blackmail.<\/p>\n\n\n\n<p>As a believer myself, I hardly believe in coincidences.<\/p>\n\n\n\n<p>I do not believe that a godly design accidentally provided humans with “free will”. Whatever entity to which we owe our presence on earth has made personal agency a necessity for dignified living.<\/p>\n\n\n\n<p>Free will, intellectual capacity, love for one another are instilled in us, so that our steps towards the good and the right are not guided by fear or desperation, but by faith and autonomous choice.<\/p>\n\n\n\n<p>We are not forced to do good, we are entrusted by The Beyond, to do so.<\/p>\n\n\n\n<p>Because of this agency that defines our personhood, the faithful should show regard for the scriptures that inspire them to do better, rather than veneration for the messengers or spaces through which we are enlightened. Thus, we are inspired indeed, but hardly misled&#8230;for while the scriptures may be perfect, those who speak it, by virtue of their humanness, are not. We are ALL fallible, therefore we must ALL remain accountable.<\/p>\n\n\n\n<p>Leadership itself is an act of service that is only of benefit when accountability reigns. Whether the head of your family or a community leader, a revered spiritual guide or a senior public servant, the power through which one leads is granted by those who are led, and this power can be taken back.<\/p>\n\n\n\n<p>The faiths that have served Rwanda in its darkest times are a treasured gift from God, to protect, to grant new beginnings to His children.<\/p>\n\n\n\n<p>Therefore, the entities that these children have trusted to govern faithfully, fairly and with unwavering commitment, will always make sure those entrusted to guide us in our faiths, remain as accountable as we ALL must be.<\/p>\n\n\n\n<p>I hope to rest my case with one parting message: we must ALL engage in the personal quest, and embrace the individual responsibility of remaining clean in body, mind and soul. After all, cleanliness is, indeed, next to Godliness.<\/p>\n\n\n\n<p>Quite simply, this is the right way to live, kuko u Rwanda rukwiye ibyiza!<\/p>\n\n\n\n<p>I wish us all the best of luck, and may the cleanse do us good.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The past few months have been a whirlwind of celebrations, with Rwandans from every corner of the country rejoicing over new milestones, new aspirations, and a renewed opportunity to bring our “big dreams” to life. I can still hear the chants from seas of colourfully-clad citizens, beaming under a fierce mid-year sun, undeterred by its [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":4995,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[52],"tags":[],"class_list":["post-4994","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-our-story"],"acf":[],"_links":{"self":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts\/4994","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/comments?post=4994"}],"version-history":[{"count":1,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts\/4994\/revisions"}],"predecessor-version":[{"id":4996,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts\/4994\/revisions\/4996"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/media\/4995"}],"wp:attachment":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/media?parent=4994"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/categories?post=4994"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/tags?post=4994"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}