{"id":4997,"date":"2024-04-24T05:58:00","date_gmt":"2024-04-24T05:58:00","guid":{"rendered":"https:\/\/imbutofoundation.org\/?p=4997"},"modified":"2025-02-14T05:59:35","modified_gmt":"2025-02-14T05:59:35","slug":"kwibuka-ni-inshingano-jenoside-si-ikamba-twirata-2","status":"publish","type":"post","link":"https:\/\/imbutofoundation.org\/kwibuka-ni-inshingano-jenoside-si-ikamba-twirata-2\/","title":{"rendered":"Kwibuka ni Inshingano, Jenoside si Ikamba twirata"},"content":{"rendered":"\n<p><strong>Kwibuka ni Inshingano, Jenoside si Ikamba twirata<\/strong><\/p>\n\n\n\n<p><strong>Twibuke, Twiyubaka.<\/strong><\/p>\n\n\n\n<p>Imyaka 30 irashize, u Rwanda ruvuye mu icuraburindi aho rwari rutwikiriwe n’igihu cy’umwijima umuntu atatekereza ko cyakweyuka!<\/p>\n\n\n\n<p>Biteye isoni bikanashengura umutima, kubona nyuma y’imyaka igera kuri 30, Abanyarwanda tukirwana no gusobanurira ukuri kw’amateka yacu – amateka asobanutse kandi yanditswe neza, abantu ubusanzwe bazwiho kumva no guharanira ukuri.<\/p>\n\n\n\n<p>Igishengura umutima, nticyica ngo kigarukire aho gusa, ahubwo hejuru y’agashinyaguro n’umubabaro w’Abazize Jenoside yakorewe Abatutsi, hari abahisemo kugoreka amateka y’urupfu bishwe, aho kubaha icyubahiro kibakwiriye ngo babareke baruhukire mu mahoro.<\/p>\n\n\n\n<p>Mpisemo kwandika kuko mpora nibaza. Aka gashinyaguro kazakomeza kugeza ryari?<\/p>\n\n\n\n<p>Birababaje kubona bisa nk’aho tugomba gukomeza kwisobanura kuri bamwe bahitamo inabi, biyemeje kugoreka amateka ya Jenoside yakorewe Abatutsi kandi yaremejwe uko ari kandi adakwiye gushidikanywaho, kuko ubundi kizira ku zindi Jenoside zabaye kandi zikemezwa mu mateka y’Isi.<\/p>\n\n\n\n<p>Aka karengane gakomeje intego, cyakora ntacyadutangaza, kuko ntacyo tutabonye – Ukuri kuzima ko turakuzi!<\/p>\n\n\n\n<p>Ni byo Abanyarwanda turacyafite intimba ariko ntituzigera dutezuka na rimwe ku kuvuga ukuri, mu gihe n’uyu munsi tukibona ko ikinyoma kirimbuzi gikomeje guhabwa intebe no mu baturanyi babonye ayo mateka.<\/p>\n\n\n\n<p>Mu gisobanuro cya Jenoside: Jenoside igira abo yibasira n’ubibasira, utoteza n’utotezwa. Nk’uko byemejwe na Loni (ONU) inyito yemewe ni ‘Jenoside yakorewe Abatutsi’. Birasobanutse!<\/p>\n\n\n\n<p>Muri Repubulika ya mbere n’iya kabiri mu gihe cya mbere ya Jenoside, abari bayoboye u Rwanda bumvaga batewe ishema no kwiyita ‘<em>Parmehutu<\/em>’ cyangwa ‘<em>Hutu Power<\/em>’, mu gihe “<em>Abatutsi bagizwe nyamuke<\/em>” batotezwaga bakanashinyagurirwa mu buryo bwose bushoboka.<\/p>\n\n\n\n<p>Mu maso y’abo bategetsi, Abatutsi bahinduwe ibivume. Bafatwaga nk’abagome biratana ubwenge, bagereranyijwe n’imungu mu muryango Nyarwanda, bakabita n’andi mazina abatesha agaciro. Ku rundi ruhande banashinjwaga kuba ibikoresho by’abakoloni kandi abakoloni nabo ubwabo baravugaga ko Abatutsi ari umwanzi ukomeye ku gihugu.<\/p>\n\n\n\n<p>Mpora nibaza impamvu kuvuga ukuri kw’aya mateka muri iki gihe, kuri bamwe bisa nk’aho ari “ugukoza agati mu ntozi”. Aho si kwa kwirengagiza nyine no kurebera, abantu batotezwa bicwa, kwatumye baturoha mu nyanja y’urwango n’ivangura byabibwe igihe kirekire, bikatugeza aho bifuzaga?<\/p>\n\n\n\n<p>Ibi bikorwa byavuyemo itoteza ryakorewe Abatutsi igihe kirekire, n’ubu turacyabyumva hafi yacu.<\/p>\n\n\n\n<p>Muri uwo mugambi mubisha, “<em>Umututsi<\/em>” yagombaga kubanza guteshwa agaciro no guhindurwa ubusa igihe kirekire. Agahindurwa igicibwa mu maso ya bose bityo bikorohereza buri wese kumwica urw’agashinyaguro no kumurimbura burundu.<\/p>\n\n\n\n<p>Mu 1994 hafi isi yose yarareberaga ubwo twamburwaga ubumuntu, imisozi yose y’u Rwanda yahinduwe imva.<br>Birengagije ko Abanyarwanda bose nabo bakwiriye kubaho, n’ubu bakaba batinyuka kurenzaho guhonyora amateka yacu nkana!<\/p>\n\n\n\n<p>None ni ukubera iki hari ijisho ry’ubugambanyi risa n’irihora kuri aba banyarwanda batereranywe kuva kera ndetse banafatwa nk’ ‘abateye ipfunwe batanakwiye kugera ahabona’?<\/p>\n\n\n\n<p>Simfite amagambo yabivuga uko biri.<\/p>\n\n\n\n<p>Nta jambo mbona rikwiye ryasobanura aka kaga kagwiriye u Rwanda; iyo witegereje umwete wa bamwe mu guhimba inkuru no kugoreka amateka bagamije gukuza ivangura uko tugeze mu gihe cyo Kwibuka; kwirengagiza nkana amahitamo yacu nk’Abanyarwanda, ndetse n’ibakwe bafite ryo kwanga kwemera ukuri ku kuba twarabohowe n’abacu bitanze bagahagarika Jenoside.<\/p>\n\n\n\n<p>Nyamara kandi twongere twibuke ko abo birengagiza ukuri, aribo bareberaga icyaha gikorwa, igihe Abatutsi bicwaga buhoro buhoro, bakabihunza amaso, bagahitamo guceceka.<\/p>\n\n\n\n<p>Biratangaje rero kumva impuruza yabo idasanzwe, bituma umuntu anibaza byinshi.<\/p>\n\n\n\n<p>Mbese ubu burakari bwari hehe igihe amoko yandikwaga mu ndangamuntu kugira ngo bizorohe guhiga Abatutsi igihe cyose, no kubamenesha mu rwababyaye, bakoherezwa ishyanga?<\/p>\n\n\n\n<p>Kuki ubwo burakari bwakajije ubukana, igihe Abanyarwanda bahitagamo Guverinoma y’Ubumwe bwabo?<\/p>\n\n\n\n<p>Ku bakinigwa n’imvugo bakoresha kuri Jenoside yahekuye u Rwanda, imyaka 30 ikaba ishize bakirwana nabyo nagira ngo mbibarize: Ese koko mwahisemo kwiyambura ubumuntu mutinya kuvuga ko Jenoside yakorewe Abatutsi, kuko mutekereza ko ari ugutera ingabo mu bitugu ubuyobozi bw’ u Rwanda – ‘Ubuyobozi mwita ko bubangamye’?<\/p>\n\n\n\n<p>Ariko ibi ntabwo aribyo bitera urujijo kurusha; hadutse uruvangitirane rugamije kuyobya uburari: ubujura bw’amabuye y’agaciro, ubwicanyi bugamije kurimbura ubwoko, abajenosideri bahunze bagikomeje umugambi mubisha wo kurimbura abantu, basize badasoje.<\/p>\n\n\n\n<p>N’abemera koko, ko hari abatotezwa muri aka Karere dutuyemo, babisasira igisobanuro cy’uko abamburwa ubumuntu ari abavuga ururimi rw’Ikinyarwanda, kandi ahubwo ari ishingiro ry’urwango rwihishe inyuma ya Jenoside. Nyamara ntawe ukwiye kuvutswa ubuzima azira uko ari.<\/p>\n\n\n\n<p>Ibi bituma umuntu yibaza uwungukira mu gutera urujijo ku ngingo nk’izi zitandukanye zidakwiriye no guhuzwa. Ese ubwo ahari uburyarya no kwigiza nkana ni he?<\/p>\n\n\n\n<p>Binyuze mu bitangazamakuru n’inama zitandukanye, turacyumva imvugo zihembera urwango, tukabona kandi tugasoma amagambo y’urukozasoni, abwirwa abarokotse Jenoside anagamije kubaca intege, mu rugendo rwo kwiyubakira Igihugu.<br>Hari ubwo wibaza ahari ko habuze umutimanama n’ubushishozi ukaba wanagira ngo ni ubunebwe no kwigiza nkana by’abandika bene nk’ibi. Uzumva bavuga bati: ‘<em>Aba bategetsi barangwa n’ivanguramoko, basahura abakene<\/em>, ‘<em>umutungo kamere ukaba watuma bamara imbaga<\/em>’!<br>Iyo kurimbura ubwoko biza kuba biterwa no kurwanira umutungo kamere, uyu mugabane wacu wakagize abagizweho ingaruka n’ibyo bikorwa bake.<\/p>\n\n\n\n<p>Hari byinshi bidasobanutse!<\/p>\n\n\n\n<p>Ni inde wungukira muri iki kinyoma?<\/p>\n\n\n\n<p>Ese indangagaciro zacu zaracengewe, zirahutazwa ku buryo twemera gucibwamo ibice byoroshye bityo n’abashaka kutuyobya, ndetse ntitunabibone?<\/p>\n\n\n\n<p>Mu gihe dusoma ibi binyoma ku mateka y’u Rwanda, bikorwa ndetse bigakwirakwizwa cyane mu bihe byo Kwibuka, nk’aho ibikomere dufite bidahagije…tugomba gukomeza kurwanya abavuga amateka yacu uko atari.<br>Biratangaje kubona hari abasa nk’aho bakumbura ya minsi y’urwango n’amacakubiri byari byarahawe umwanya mu gihugu kidafite ubuzima, gishishikajwe no kwimaraho abana gikoresheje imihoro aho kuyikoresha icyo yagenewe, ngo ikorere imirima izatunga abatuye igihugu.<\/p>\n\n\n\n<p>Ese amateka ntacyo yatwigishije?<\/p>\n\n\n\n<p>Iryo vanguramoko rifite agaciro kahe mu buzima bwabo ku buryo bemera gukomeza kuba imbata y’ibyo bitekerezo?<\/p>\n\n\n\n<p>Ukuri turakuzi! Tuzi neza abo Jenoside yibasiraga kandi ntituzigera tubibagirwa.<\/p>\n\n\n\n<p>Ikindi twize ni uko u Rwanda rw’uyu munsi, uru Rwanda rwishakamo ibisubizo, uru Rwanda rwateye imbere, rudashobora guha umwanya ibidateza imbere igihugu nko kubiba amoko mu bantu. Twese twasobanukiwe ko turi Abanyarwanda.<\/p>\n\n\n\n<p>Twese turi Abanyarwanda, uru Rwanda ni urwacu twese!<\/p>\n\n\n\n<p>Ntituzongera kwemera ko rutemba amaraso y’abacu.<\/p>\n\n\n\n<p>Kuri iyi nshuro ya 30 twibuka, inkovu ziracyari mbisi, kandi birumvikana turacyababaye, ariko tugira icyizere n’umunezero iyo tureba aho abato babyiruka baganisha uru Rwanda rwacu.<\/p>\n\n\n\n<p>Iyo tuvuga “<strong>Ntibizongera ukundi<\/strong>” birenze kuba icyifuzo, ahubwo ni igihango!<\/p>\n\n\n\n<p>Gushidikanya ku bushobozi bw’u Rwanda bwo guhangara ibyananiranye byaba ari ukwibeshya gukomeye. Nyuma y’imyaka 30 y’amahoro, igihe kirageze ngo n’abirengagizaga batangire kwemera ukuri kw’amateka.<br>Abavuga ko bahangayikishijwe n’ahazaza hacu, bakwiriye gukoresha neza igihe cyabo ‘bita ku Rwanda’ mu gukumira Jenoside ndetse no guhangana n’ingengabitekerezo yayo.<\/p>\n\n\n\n<p><strong>Kuri mwe mwarokotse,<br>Tuzirikana amahitamo yanyu yo kubaho, mukanga guheranwa n’ishavu. Kwibuka bikomeze guhamya ishema dutewe no kuba mutwaje mu buzima, uyu munsi tukaba tubafite.<\/strong><\/p>\n\n\n\n<p>Mpore, Rwanda.<\/p>\n\n\n\n<p><strong>Nyakubahwa Madamu Jeannette Kagame<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Kwibuka ni Inshingano, Jenoside si Ikamba twirata Twibuke, Twiyubaka. Imyaka 30 irashize, u Rwanda ruvuye mu icuraburindi aho rwari rutwikiriwe n’igihu cy’umwijima umuntu atatekereza ko cyakweyuka! Biteye isoni bikanashengura umutima, kubona nyuma y’imyaka igera kuri 30, Abanyarwanda tukirwana no gusobanurira ukuri kw’amateka yacu – amateka asobanutse kandi yanditswe neza, abantu ubusanzwe bazwiho kumva no guharanira [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":4998,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[52],"tags":[],"class_list":["post-4997","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-our-story"],"acf":[],"_links":{"self":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts\/4997","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/comments?post=4997"}],"version-history":[{"count":1,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts\/4997\/revisions"}],"predecessor-version":[{"id":4999,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts\/4997\/revisions\/4999"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/media\/4998"}],"wp:attachment":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/media?parent=4997"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/categories?post=4997"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/tags?post=4997"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}