{"id":5003,"date":"2024-04-21T06:02:00","date_gmt":"2024-04-21T06:02:00","guid":{"rendered":"https:\/\/imbutofoundation.org\/?p=5003"},"modified":"2025-02-14T06:03:31","modified_gmt":"2025-02-14T06:03:31","slug":"we-commemorate-for-we-must-genocide-is-not-a-badge-of-honour-2","status":"publish","type":"post","link":"https:\/\/imbutofoundation.org\/we-commemorate-for-we-must-genocide-is-not-a-badge-of-honour-2\/","title":{"rendered":"We Commemorate For We Must; Genocide Is Not a Badge of Honour"},"content":{"rendered":"\n<p><strong>Twibuke, Twiyubaka.<\/strong><\/p>\n\n\n\n<p>Thirty years ago, Rwanda was plunged into darkness that seemed, at the time, impenetrable.<\/p>\n\n\n\n<p>That three decades on, Rwandans would still bear the burden of enlightening the world on our well-documented history, is of an irony so sinister, it almost pierces the heart. We ache, but not from being misunderstood. Rather, we ache that 30 years on, victims of the genocide against the Tutsi would still be subjected to hateful lies and distortions of history, from those who deliberately choose cruelty in words and actions, over decency and respectful silence.<\/p>\n\n\n\n<p>I write, because I can’t help but wonder…<em>When will enough be enough?<\/em><\/p>\n\n\n\n<p>Sadly, it seems that every commemoration, some require us to repeat ourselves on a fact otherwise accepted by all, as it pertains to other genocides throughout world history. This injustice remains ever disappointing, but no longer surprising.<\/p>\n\n\n\n<p>Rest assured; Rwandans may be grieving, but we will never be too tired to tell the truth, not when we know the deadly cost of lies of the kind that are still spread, across the region, today.<\/p>\n\n\n\n<p>Quite simply: a genocide requires a target; an oppressor and an oppressed, a tormentor and a tormented. The rightful appellation of “The Genocide Against the Tutsi” &#8211; is self-evident, as recognised by the UN.<\/p>\n\n\n\n<p>In the 1st and 2nd Republic – where some at the top of the Rwandan leadership of the time proudly referred to themselves as “Parmehutu” and “Hutu-Power” – long before the genocide, the “Tutsi minority” was vilified using every trick in the book.<\/p>\n\n\n\n<p>They were simultaneously called abusive elitists, but also social vermin; they were accused of acting as colonial pawns while at the same time, according to the colonisers themselves, of being the biggest threat to Rwanda as a nation.<\/p>\n\n\n\n<p>I wonder why revisiting these established facts seems so controversial to many today, when it was through intentional aloofness in the first place, that prospective victims were left to suffer visceral, systemic hatred for decades.<\/p>\n\n\n\n<p>The resulting violence was recurrent.<\/p>\n\n\n\n<p>Indeed, the “Tutsi” was supposed to become “helpless” to an orchestrated extermination, abandoned by all to be maimed, raped, murdered, and “erased at last”.<\/p>\n\n\n\n<p>In 1994, much of the world watched closely as Rwanda’s hills were reduced to a graveyard, but refused to&nbsp;<strong>see&nbsp;<\/strong>our humanity. They refused to see all Rwandans as&nbsp;<strong>equally&nbsp;<\/strong>worthy of living, or even deserving, to this day, of having their history acknowledged in its entirety.<\/p>\n\n\n\n<p>So why upon these once abandoned Rwandans &#8211; the “<em>unworthy of being seen<\/em>” &#8211; must this covertly complicit gaze nevertheless remain fixated?<\/p>\n\n\n\n<p>Language fails me.<\/p>\n\n\n\n<p>There are no words to describe this strange phenomenon: the enthusiasm of some towards fictional, divisive narratives at every commemoration and every other day; the misgivings whenever Rwanda dares to take ownership of its history and present reality, and the mania over the authenticity of the Liberators that stopped the genocide.<\/p>\n\n\n\n<p>We must bear in mind that this same audience once eyed the Tutsi’s gradual debasement and social alienation, in deafening silence.<\/p>\n\n\n\n<p>So, in the face of all this sudden noise, I have a few questions.<\/p>\n\n\n\n<p><em>Where was the indignation when ethnic categorisation, mentioned on identity cards, facilitated primitive violence against those presumed Tutsi for decades, forcing hundreds of thousands into exile?<\/em><\/p>\n\n\n\n<p>Why does the outrage only manifest itself when a government of national unity is formed?<\/p>\n\n\n\n<p><em>To those who bend over backwards in linguistic gymnastics, sidestepping the aimed object of the genocide that wrecked Rwanda 30 years ago, are you really willing to sacrifice that bit of basic humanity, in fear it would “boost” the “annoying” leadership of Rwanda?<\/em><\/p>\n\n\n\n<p>But this isn’t the most confusing of all; there is also a bizarre amalgam made between “resource theft”, ethnic cleansing and the determination of genocidaires in exile to “finish the job” that they had started here. I suspect the waters are murky, because beneath the surface, many issues are intentionally blurred. I remain troubled by many more questions.<\/p>\n\n\n\n<p>What is the true agenda here? Who stands to gain from deliberately causing this confusion over distinct, separate issues?<\/p>\n\n\n\n<p>We see the hateful rhetoric created, for what it is. We hear and read the shameful descriptions ascribed to survivors determined to lay their brick in the rebuilding of this country, in extremist publications and forums.<\/p>\n\n\n\n<p>Even those that admit who is really being persecuted, in our neighborhood, offer their justifications. They claim that these victims are demonised for being “Rwandophone”; as if the irrationality of the hateful savagery behind genocide, could ever be rationalised.<\/p>\n\n\n\n<p>“A thieving ethnicist ruling class, stealing from the helpless”. “Mass murder for minerals”…How chaotically lazy, malicious, and reckless!<\/p>\n\n\n\n<p>If ethnic cleansing were a natural outcome for resource theft, this rich continent would have the least casualties.<\/p>\n\n\n\n<p>There are too many holes to this story.<\/p>\n\n\n\n<p>Who stands to gain from this flawed conspiracy?<\/p>\n\n\n\n<p>Was our collective consciousness so irrevocably mutilated that we welcome being divided to be conquered; so easily, so sloppily?<\/p>\n\n\n\n<p>As we read blatant mistruths about Rwanda’s history and present choices, factory-produced and dispatched during the commemoration period in particular, as if the knife could never be twisted deep enough…..We must denounce this deplorable war of attrition!<\/p>\n\n\n\n<p>How wretched that anyone would be nostalgic for the “good old days”, when hate and division marred our country through a failed state, more concerned with slashing machetes into flesh than using them for their intended purpose: working the land that fed all our children.<\/p>\n\n\n\n<p>Have you learnt nothing?<\/p>\n\n\n\n<p>How vital is to you, that you remain a prisoner to ethnicist ideology?<\/p>\n\n\n\n<p>One thing is certain: We know and will never forget whom the genocide targeted!<\/p>\n\n\n\n<p>But what we have found nevertheless, is that the present Rwanda, the resilient Rwanda, the fast-advancing Rwanda, cannot afford to be divided by matters as inconsequential to our rebuilding, as the “ethnic identities” of the builders. Ndi Umunyarwanda; Turi Abanyarwanda.<\/p>\n\n\n\n<p>We are ALL Rwandans: these hills belong to us ALL.<\/p>\n\n\n\n<p>Never again will they ever be covered in our blood!<\/p>\n\n\n\n<p>This Kwibuka 30, the scar feels just as deep, and I will admit, it pains still. But our hope runs deeper, and the joy of seeing what the new generations will make of this freed Rwanda, outweighs the grief.<\/p>\n\n\n\n<p>Never again is not a prayer, it is a promise!<\/p>\n\n\n\n<p>To bet against Rwanda’s capacity to defy the odds would be thoroughly misguided. Thirty years along the line, after 30 years of peace, it is about time for “some” to acquire better judgment, at last.<\/p>\n\n\n\n<p>I believe that those that claim to be concerned with our fates, would find their time and “care for Rwanda” better invested in genocide prevention and the destruction of genocide ideology.<\/p>\n\n\n\n<p><strong>To you, survivor, we recognise your resolve to rise up, and your refusal to sink under the weight of this unimaginable pain. Let the protection of our memory attest to how thankful we are that you are still here today, fighting on.<\/strong><\/p>\n\n\n\n<p>Mpore, Rwanda.<\/p>\n\n\n\n<p><strong>Her Excellency First Lady of Rwanda, Mrs Jeannette Kagame<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Twibuke, Twiyubaka. Thirty years ago, Rwanda was plunged into darkness that seemed, at the time, impenetrable. That three decades on, Rwandans would still bear the burden of enlightening the (…)<\/p>\n","protected":false},"author":1,"featured_media":5001,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[52],"tags":[],"class_list":["post-5003","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-our-story"],"acf":[],"_links":{"self":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts\/5003","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/comments?post=5003"}],"version-history":[{"count":1,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts\/5003\/revisions"}],"predecessor-version":[{"id":5004,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts\/5003\/revisions\/5004"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/media\/5001"}],"wp:attachment":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/media?parent=5003"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/categories?post=5003"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/tags?post=5003"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}