{"id":5141,"date":"2024-09-27T01:52:00","date_gmt":"2024-09-27T01:52:00","guid":{"rendered":"https:\/\/imbutofoundation.org\/?p=5141"},"modified":"2025-02-17T07:54:29","modified_gmt":"2025-02-17T07:54:29","slug":"imyaka-30-twubaka-umuntu-ucyeye-umubiri-ucyeye-umutima-nama-umutima-mana","status":"publish","type":"post","link":"https:\/\/imbutofoundation.org\/imyaka-30-twubaka-umuntu-ucyeye-umubiri-ucyeye-umutima-nama-umutima-mana\/","title":{"rendered":"Imyaka 30 twubaka umuntu ucyeye: Umubiri ucyeye, umutima-nama, umutima-mana"},"content":{"rendered":"\n<p>Ndacyumva urusobe rw’amajwi meza n’injyana, byirangira ku misozi itatse amabara meza, atanga icyizere.<\/p>\n\n\n\n<p>Ndacyumva umurindi w’Abanyarwanda bashyize hamwe mu njyana imwe, badakangwa n’izuba ry’impeshyi!<\/p>\n\n\n\n<p>Iminsi ishize yaranzwe n’ibirori, aho Abanyarwanda baturutse impande zose, bizihiza amahitamo meza twagize, yo gukora dushyize hamwe ngo duhindure inzozi zacu impamo.<\/p>\n\n\n\n<p>Nk’uko umuhanzi ahera ku busa, akarema igihangano gitangaje, nk’uko urusobe rw’ubumenyi n’umwihariko bya buri wese, ari byo bigira icyerekezo cy’igihugu cyacu, mureke natwe rero tubyegereze umutima.<\/p>\n\n\n\n<p>Umuturage ku isonga, ubu ni isengesho ryacu rya buri munsi. Uwahawe inshingano zo kumuyobora nawe, agahora iteka atekereza kandi afatanyije na we gushaka icyamuteza imbere.<\/p>\n\n\n\n<p>Ariko kandi ibi, ntabwo ari inshingano z’abari mu mirimo runaka gusa, ahubwo twese biratureba.<\/p>\n\n\n\n<p>Rwanda &#8211; Nziza<\/p>\n\n\n\n<p>Hari abasesengura, bavuga ko kuba twarahize kubaka Umunyarwanda ushoboye kandi utekanye, ndetse tukaba dufite aho tubigeze, tubikesha gusa ibitangaza by’Imana.<\/p>\n\n\n\n<p>Kwimakaza ubumwe bw’Abanyarwanda mbere ya byose, kuzuza no kubazwa inshingano, kugira isuku hose no muri byose, kwita ku rubyiruko, n’ibindi byiza, ntituzabigezwaho n’amahirwe gusa, kuko n’Imana ifasha uwifashije. Aya mahitamo yacu agerwaho n’uwumvise u Rwanda twifuza, yakongeraho n’ubushake bwe, tukubaka ubudasa bw’u Rwanda<\/p>\n\n\n\n<p>Dutanage kandi tunoze intango.<\/p>\n\n\n\n<p>Abakurambere bacu bari baratekereje umuntu wuzuye kandi ucyeye.<br>● Bemeraga ko kwita no kubaka umubiri ari ngombwa, ariko bagatekereza ko bidakwiye gusumba ibindi byose. Aha twavuga nko gutekereza ku byo dufungura, ari na byo bitunga umubiri w’umuntu, kugira isuku ku mubiri n’aho utuye.<br>● Bakemera ko umuntu agira umutima-nama umufasha kugira ibitekerezo bizima, bicyeye kandi byubaka abantu n’igihugu.<br>● Akagira ndetse n’umutima-mana umuha kugira ibyo yemera byubaka umuntu n’u Rwanda.<\/p>\n\n\n\n<p>U Rwanda twifuza ni u Rwanda rutuwe n’abafite isuku haba ku mubiri, mu myitwarire, mu bikorwa ndetse no mu mitekerereze.<\/p>\n\n\n\n<p>Ntituzahweme kubyibuka, kabone n’ubwo twaba dukikijwe n’abatwambika icyasha, cyangwa abakomeza gutera urujijo.<\/p>\n\n\n\n<p>Imihanda yacu, aho dukorera, amazu y’ubucuruzi, aho dutuye, hose hakwiye isuku, kuko ni kimwe mu bigaragaza umuryango wiyubaha kandi wihesha agaciro &#8211; bitabaye ibyo, kwiha agaciro k’Umuryango-Nyarwanda tuvuga ntabwo byaba byuzuye neza.<\/p>\n\n\n\n<p>Kugera k’ U Rwanda n’abarutuye birangwa n’umucyo, byadusabye guca mu rugendo rurerure kandi rutoroshye. Ibi byari ngombwa kugira ngo tuvane igihugu cyacu mw’icuraburindi.<\/p>\n\n\n\n<p>Ntitwatinyuka gusenya ibyo twubatse ngo dutize umurindi abibasira umugabane wacu; cyane cyane ku babyiruka ubu, bagize amahirwe yo kutamenya u Rwanda igihe rwari rukiri mu mwijima.<\/p>\n\n\n\n<p>Kugira isuku ni indangagaciro rusange, ntabwo ari umwihariko wa bamwe. Ntawe ukwiye kwemera ko ubuzima bwe burangwa n’isuku nke.<\/p>\n\n\n\n<p>Usubiye mu mateka y’isi, ni henshi twumvise ibyorezo bikomeye biterwa n’isuku nke bihitana ibihumbi n’ibihumbi by’abantu.<\/p>\n\n\n\n<p>Uko byagenda kose, igihe umuntu atitaye ku mubiri we nk’uko bikenewe, nta kabuza ingaruka zirigaragaza mu buzima bwe. Na wa wundi ufite ubuzima bwiza, udasanganywe uburwayi runaka, ubudahangarwa bw’umubiri bugeraho bugacyendera.<\/p>\n\n\n\n<p>Uko twita ku mubiri wacu w’inyuma kugira ngo dukunde tugaragare neza, bikwiye guhora bijyana no kugenzura amafunguro n’ibinyobwa dufata.<\/p>\n\n\n\n<p>Nta wavomera urubuto akoresheje amazi ahumanye, kuko rutashibuka. Ese ibi hari aho bitaniye no gufata amafunguro cyangwa ibinyobwa bitwangiza?<br>Ni iki umubiri wacu waba warakoze cyatuma dukomeza kuwuhanisha ibiwuhumanya?<\/p>\n\n\n\n<p>Igihe kirageze ngo isuku tuvuga igaragare no muri byose, hose, igihe cyose.<\/p>\n\n\n\n<p>Tugire umutima-nama wanga ibidahwitse!<\/p>\n\n\n\n<p>Umubiri wacu ni nk’ingoro, ituwe n’umuntu wacu w’imbere! Gusukura umuntu w’imbere rero ni ngombwa! Bikwiye no kwitabwaho nk’uko twita ku isuku yo ku mubiri. Umwuka wanduye ushobora kwangiza n’isura tubona inyuma.<br>Kuko umuntu ari mugari, rero ni nayo mpamvu gusukura umuntu w’imbere &#8211; aho tutabonesha amaso bishobora kuba bigoye kurushaho.<\/p>\n\n\n\n<p>Mu gihe turi mu isi igengwa n’uruvange rw’ amakuru n’ibigezweho, hari ubwo bigorana kumenya ibishobora gushyira ubuzima mu kaga. Kumenya gutandukanya ijwi riburira ry’umutima-nama n’ibishuko, imyidagaduro n’ibirangaza, ubumenyi n’ibiduhuma amaso, kwiyerekana uko uri no kwikunda, ndetse n’ubwisanzure n’ingeso mbi.<\/p>\n\n\n\n<p>Kurarikira ibigezweho tudashishoje ngo twirinde ibirimo ibinyoma &#8211; akaba ari nabyo twifuza kubamo, ni byo byahinduye imyumvire yacu; bitwigisha ingeso mbi zo guhora umuntu ashaka ikuzo no gushaka igikundiro mu buriganya.<\/p>\n\n\n\n<p>Ibi byatwibagije umuco wo guhora twihugura no gukorera ubuvugizi, ibyo tubona bikeneye kwitabwaho, by’umwihariko mu muryango.<\/p>\n\n\n\n<p>Hari ubwo umuntu yisanga akeneye umwanya w’ikiruhuko, kure y’urusaku rw’inkuru n’amakuru bihumanye, ngo afate umwanya wo gutekereza no gusesengura.<\/p>\n\n\n\n<p>Ibi kandi bikwiye kuba umuco n’inshingano za buri muntu nk’uko twibuka isuku y’umubiri buri gitondo.<br>Dukwiye gufata n’ umwanya wo gusukura ibitekerezo, tugatarama, tukicarana n’abandi tukabatega amatwi tubishyizeho umutima. Tukagena umwanya wo gusangira ubumenyi, tukitoza kuganira, tukajya inama tudaca imanza.<\/p>\n\n\n\n<p>Ibi tubitekerezeho, kugira ngo twibukiranye umuco wacu mwiza wadufashaga gusukura wa muntu w’imbere.<\/p>\n\n\n\n<p>Ihurizo ry’iyobokamana n’imyemerere<\/p>\n\n\n\n<p>Ntawaganira ku kwiyeza ngo yirengagize iyobokamana, amadini n’imyemerere.<\/p>\n\n\n\n<p>Ukwemera uko ari ko kose umuntu yaba afite, ntawe utarahuye cyangwa utarumvise inyigisho zijyanye n’imyemerere, zikangurira abantu kwiyeza bakarangwa n’indangagaciro zikwiriye abemera Imana.<br>Aha twavuga:<br>● Kuba umunyakuri,<br>● Kuba inyangamugayo,<br>● Guca bugufi no gukomeza kwiyoroshya,<br>● Kugira neza,<br>● Kugira urukundo (Yohana 13: 34-35: Ndabaha itegeko rishya ngo mukundane nk’uko nabakunze, mube ari ko namwe mukundana. Ibyo ni byo bose bazabamenyeraho ko muri abigishwa banjye, nimukundana.)<br>Urukundo ni wo muhamagaro duhuriraho twese mu myemerere yacu itandukanye, rukaba kandi n’indangagaciro isumba zose.<\/p>\n\n\n\n<p>Dukwiye kwitondera abigisha bakoresha uburiganya, ngo bayobye abantu n’ubutumwa bwabo bubogamye.<\/p>\n\n\n\n<p>Imana yacu ni Imana y’imbabazi, urukundo, impuhwe, ubumwe kandi ni Imana irinda. Ntabwo ari Imana y’iterabwoba. Ni Imana igaba. Iraguha ntimugura.<\/p>\n\n\n\n<p>Nk’abemera Imana ntabwo dushingira ukwizera kwacu mu mahirwe no kuba ibintu runaka byabaho bitugwiririye.<\/p>\n\n\n\n<p>Mu kuduha ubushobozi bwo guhitamo no gushishoza, ntabwo Imana yabiduhaye nta ntego. Imbaraga dukesha kubaho kwacu, zaduhaye n’ubushobozi bwo guhitamo neza mu buryo buri muntu yihesha agaciro.<\/p>\n\n\n\n<p>Amahitamo, ubwenge, kugira urukundo ni byo bikwiye kuyobora intambwe zacu. Kugira ngo tutagengwa n’ubwoba no kwiheba, ahubwo tugendere mu kwizera no gusobanukirwa, ko dufite ubwo bushobozi bwo kwihitiramo ibitubereye.<\/p>\n\n\n\n<p>Ntawe uduhatira gukora ibyiza, ahubwo biri mu nshingano twahawe n’Imana.<br>Kubera ubu bubasha dufite bwo kwihitiramo ibitubereye, abizera bakwiye kuyoborwa n’ibyanditse. Bagakurikiza icyo ijambo risaba, aho guterwa ubwoba n’abitwaza ijambo bakarigoreka. Ni byo koko umuntu ni umuntu kandi ni umunyantege nke, ariko ntibikuraho ko akwiye kubazwa inshingano.<\/p>\n\n\n\n<p>Umuyobozi mwiza ni ukorera abo ayobora, kandi akemera kubazwa inshingano. Yaba umukuru w’umuryango cyangwa umuyobozi aho utuye, mu nzego z’ibanze, no mu iyobokamana.<\/p>\n\n\n\n<p>Ububasha n’icyubahiro bijyana no kwitwa umuyobozi, ubihabwa n’abo uyobora, kandi igihe icyari cyo cyose ushobora kubyamburwa, iyo izo nshingano zitubahirijwe.<\/p>\n\n\n\n<p>Kugira ibyiringiro, byagiye bifasha u Rwanda mu bihe bigoye twanyuzemo. Iyi ni impano ikomeye yavuye ku Mana y’i Rwanda, kandi yabaye umusemburo w’amahoro n’icyizere cyo kongera kubaho ku bana bayo.<\/p>\n\n\n\n<p>Ni nayo mpamvu hari icyizere, ko ubuyobozi bukorera mu mucyo, bushyira umuturage ku isonga, butazahwema kutwibutsa twese, ko igihe ufite Abanyarwanda mu nshingano, ugomba gukorera mu mucyo kandi ukemera kubazwa inshingano.<\/p>\n\n\n\n<p>Twese turazwe ishinga no kwita ku isuku y’umubiri, ibitekerezo, ndetse na roho.<\/p>\n\n\n\n<p>Tugire umubiri ucyeye, umutima-nama n’umutima-mana bibereye Umunyarwanda.<\/p>\n\n\n\n<p>Tubizirikane!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ndacyumva urusobe rw’amajwi meza n’injyana, byirangira ku misozi itatse amabara meza, atanga icyizere. Ndacyumva umurindi w’Abanyarwanda bashyize hamwe mu njyana imwe, badakangwa n’izuba (…)<\/p>\n","protected":false},"author":1,"featured_media":4995,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[52],"tags":[],"class_list":["post-5141","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-our-story"],"acf":[],"_links":{"self":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts\/5141","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/comments?post=5141"}],"version-history":[{"count":1,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts\/5141\/revisions"}],"predecessor-version":[{"id":5142,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/posts\/5141\/revisions\/5142"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/media\/4995"}],"wp:attachment":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/media?parent=5141"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/categories?post=5141"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/tags?post=5141"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}