{"id":2000,"date":"2024-10-14T09:58:04","date_gmt":"2024-10-14T09:58:04","guid":{"rendered":"https:\/\/imbutofoundation.org\/?post_type=partner&#038;p=2000"},"modified":"2025-01-08T14:18:42","modified_gmt":"2025-01-08T14:18:42","slug":"rwanda-psychological-society","status":"publish","type":"partner","link":"https:\/\/imbutofoundation.org\/partner\/rwanda-psychological-society\/","title":{"rendered":"RWANDA PSYCHOLOGICAL SOCIETY"},"content":{"rendered":"\n<p>The Rwanda Psychological Society (RPS) is a national professional organization and regulatory body of Psychologists in Rwanda that was established August 1st, 2015 in conformity with the Law No 04\/2012 of 17\/02\/2012 governing the organization and the functioning of national non-governmental organizations, especially in its articles 3, 5, 6, 10, 11 and 28. As a background, and following the 1994 genocide perpetrated against Tutsi in Rwanda, the government resolved in 1998 to start the training of clinical psychologists as a response to the mass traumas from the genocide. The first clinical psychologists graduated from the National University of Rwanda, currently University of Rwanda, and were immediately absorbed in the community to assist those requiring psychological service. In addition to clinical psychologists, the country gained from other universities abroad availing training in other orientations in psychology like social psychology, school psychology, psychological counselling, and others.<\/p>\n\n\n\n<p>With time, it became obvious that, plus the general training get from universities, psychologists at work require addition opportunities for continuing professional development (CPD) training and supervision to ensure a delivery of service of quality to beneficiaries and wellness of the practitioners. Moreover, and given the pervasive impact of the post-genocide psychological trauma considered to damage the social development and the growth of the country, it was assumed that an organization of experts in psychology can contribute to the country development through community engagement and outreach activities. Therefore, gathered in Constituant Assembly on August 1st 2015, Psychologists from the different orientations in Psychology resolved to create the Rwanda Psychological Society (RPS) as a response to both continuous training gaps and the community involvement.<\/p>\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Rwanda Psychological Society (RPS) is a national professional organization and regulatory body of Psychologists in Rwanda that was established August 1st, 2015 in conformity with the Law No 04\/2012 of 17\/02\/2012 governing the organization and the functioning of national non-governmental organizations, especially in its articles 3, 5, 6, 10, 11 and 28. <\/p>\n","protected":false},"template":"","meta":{"_acf_changed":true},"partnership":[33],"class_list":["post-2000","partner","type-partner","status-publish","hentry","partnership-primary"],"acf":[],"_links":{"self":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/partner\/2000","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/partner"}],"about":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/types\/partner"}],"wp:attachment":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/media?parent=2000"}],"wp:term":[{"taxonomy":"partnership","embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/partnership?post=2000"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}