{"id":2005,"date":"2024-10-14T10:02:54","date_gmt":"2024-10-14T10:02:54","guid":{"rendered":"https:\/\/imbutofoundation.org\/?post_type=partner&#038;p=2005"},"modified":"2025-01-08T14:19:06","modified_gmt":"2025-01-08T14:19:06","slug":"national-rehabilitation-service","status":"publish","type":"partner","link":"https:\/\/imbutofoundation.org\/partner\/national-rehabilitation-service\/","title":{"rendered":"NATIONAL REHABILITATION SERVICE"},"content":{"rendered":"\n<p>Delinquency is a global problem which may differ in causes from one nation to another. Research shows that the risk factors related to delinquency are compounded by drug abuse, poverty, political instability, urbanization, dysfunctional family, violence, peer influence and limited income generating opportunities among others. Young people are mainly at risk not just because they may turn to substance abuse, street living and petty crimes as a way of dealing with the difficulties they face but also because they are ambitious and are in danger of being exploited.<\/p>\n\n\n\n<p>Delinquency in Rwanda is not a new phenomenon; however, it has been worsened by the effects of the 1994 genocide against the Tutsi in Rwanda and its subsequent consequences. Rwanda’s Economy and the Social well-being of the Citizens were on the brink of total collapse in 1994. The psychological aspect of citizens was highly compromised and thus results of trauma, loss of hope, sense of direction and purpose of life. The most delinquent stricken part of the Rwandan population lies between 14 and 35 years old.<br>Delinquency is like a “double edged sword that hurts two at once”. It is not only hurts one’s community and country but also leaves significant impacts to the life of the delinquents themselves. The delinquency has economic and social cultural effects on the individuals, families, communities as well as the entire society and a nation in general.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Delinquency is a global problem which may differ in causes from one nation to another. Research shows that the risk factors related to delinquency are compounded by drug abuse, poverty, political instability, urbanization, dysfunctional family, violence, peer influence and limited income generating opportunities among others.<\/p>\n","protected":false},"template":"","meta":{"_acf_changed":true},"partnership":[33],"class_list":["post-2005","partner","type-partner","status-publish","hentry","partnership-primary"],"acf":[],"_links":{"self":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/partner\/2005","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/partner"}],"about":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/types\/partner"}],"wp:attachment":[{"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/media?parent=2005"}],"wp:term":[{"taxonomy":"partnership","embeddable":true,"href":"https:\/\/imbutofoundation.org\/wp-json\/wp\/v2\/partnership?post=2005"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}